jmeter.log
2020-04-19 00:11:36,776 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2020-04-19 00:11:36,813 INFO o.a.j.JMeter: Loading user properties from: /usr/local/Cellar/jmeter/5.2.1/libexec/bin/user.properties
2020-04-19 00:11:36,813 INFO o.a.j.JMeter: Loading system properties from: /usr/local/Cellar/jmeter/5.2.1/libexec/bin/system.properties
2020-04-19 00:11:36,815 INFO o.a.j.JMeter: Copyright (c) 1998-2019 The Apache Software Foundation
2020-04-19 00:11:36,816 INFO o.a.j.JMeter: Version 5.2.1
2020-04-19 00:11:36,816 INFO o.a.j.JMeter: java.version=1.8.0_191
2020-04-19 00:11:36,816 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2020-04-19 00:11:36,816 INFO o.a.j.JMeter: os.name=Mac OS X
2020-04-19 00:11:36,816 INFO o.a.j.JMeter: os.arch=x86_64
2020-04-19 00:11:36,816 INFO o.a.j.JMeter: os.version=10.15.4
2020-04-19 00:11:36,816 INFO o.a.j.JMeter: file.encoding=UTF-8
2020-04-19 00:11:36,816 INFO o.a.j.JMeter: java.awt.headless=true
2020-04-19 00:11:36,816 INFO o.a.j.JMeter: Max memory     =1073741824
2020-04-19 00:11:36,816 INFO o.a.j.JMeter: Available Processors =4
2020-04-19 00:11:36,823 INFO o.a.j.JMeter: Default Locale=English (EN)
2020-04-19 00:11:36,823 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2020-04-19 00:11:36,823 INFO o.a.j.JMeter: JMeterHome=/usr/local/Cellar/jmeter/5.2.1/libexec
2020-04-19 00:11:36,823 INFO o.a.j.JMeter: user.dir  =/Users/naresh/git-workspace/jmeter-performance-testing
2020-04-19 00:11:36,824 INFO o.a.j.JMeter: PWD       =/Users/naresh/git-workspace/jmeter-performance-testing
2020-04-19 00:11:36,825 INFO o.a.j.JMeter: IP: 127.0.0.1 Name: Nareshs-MacBook-Pro.local FullName: localhost
2020-04-19 00:11:36,828 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'/Users/naresh/git-workspace/jmeter-performance-testing/list-users-results'
2020-04-19 00:11:36,832 INFO o.a.j.s.FileServer: Default base='/Users/naresh/git-workspace/jmeter-performance-testing'
2020-04-19 00:11:36,842 INFO o.a.j.s.FileServer: Set new base='/Users/naresh/git-workspace/jmeter-performance-testing'
2020-04-19 00:11:37,066 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2020-04-19 00:11:37,091 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2020-04-19 00:11:37,100 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2020-04-19 00:11:37,110 INFO o.a.j.s.SaveService: Loading file: /Users/naresh/git-workspace/jmeter-performance-testing/list-users-rest-performance.jmx
2020-04-19 00:11:37,175 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-04-19 00:11:37,175 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-04-19 00:11:37,175 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-04-19 00:11:37,175 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-04-19 00:11:37,175 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2020-04-19 00:11:37,175 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2020-04-19 00:11:37,222 INFO o.a.j.JMeter: Creating summariser <summary>
2020-04-19 00:11:37,229 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2020-04-19 00:11:37,229 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: /Users/naresh/git-workspace/jmeter-performance-testing/list-users-rest-performance.jtl
2020-04-19 00:11:37,230 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: /usr/local/Cellar/jmeter/5.2.1/libexec/bin/reportgenerator.properties
2020-04-19 00:11:37,230 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2020-04-19 00:11:37,237 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2020-04-19 00:11:37,241 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2020-04-19 00:11:37,241 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction is empty, not APDEX per transaction customization
2020-04-19 00:11:37,241 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2020-04-19 00:11:37,241 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2020-04-19 00:11:37,241 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2020-04-19 00:11:37,241 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2020-04-19 00:11:37,241 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2020-04-19 00:11:37,242 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2020-04-19 00:11:37,247 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2020-04-19 00:11:37,247 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-04-19 00:11:37,247 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2020-04-19 00:11:37,247 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2020-04-19 00:11:37,247 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2020-04-19 00:11:37,247 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2020-04-19 00:11:37,248 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-04-19 00:11:37,248 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-04-19 00:11:37,248 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-04-19 00:11:37,248 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-04-19 00:11:37,249 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2020-04-19 00:11:37,249 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2020-04-19 00:11:37,249 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2020-04-19 00:11:37,250 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2020-04-19 00:11:37,250 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2020-04-19 00:11:37,250 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2020-04-19 00:11:37,256 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2020-04-19 00:11:37,263 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-04-19 00:11:37,264 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-04-19 00:11:37,278 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2020-04-19 00:11:37,278 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2020-04-19 00:11:37,662 INFO o.a.j.JMeter: Running test (1587235297662)
2020-04-19 00:11:37,694 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : rest-performance-thread-group
2020-04-19 00:11:37,694 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group rest-performance-thread-group.
2020-04-19 00:11:37,694 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2020-04-19 00:11:37,694 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2020-04-19 00:11:37,699 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2020-04-19 00:11:37,699 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2020-04-19 00:11:37,700 INFO o.a.j.t.JMeterThread: Thread started: rest-performance-thread-group 1-1
2020-04-19 00:11:37,732 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = Nareshs-MacBook-Pro.local
2020-04-19 00:11:37,745 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2020-04-19 00:11:37,747 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2020-04-19 00:11:37,747 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2020-04-19 00:11:37,747 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2020-04-19 00:11:37,747 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2020-04-19 00:11:37,887 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2020-04-19 00:11:37,894 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2020-04-19 00:11:37,894 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2020-04-19 00:11:38,134 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2020-04-19 00:11:38,135 INFO o.a.j.u.SSLManager: KeyStore created OK
2020-04-19 00:11:38,136 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2020-04-19 00:11:38,348 INFO o.a.j.t.JMeterThread: Thread is done: rest-performance-thread-group 1-1
2020-04-19 00:11:38,348 INFO o.a.j.t.JMeterThread: Thread finished: rest-performance-thread-group 1-1
2020-04-19 00:11:38,350 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2020-04-19 00:11:38,351 INFO o.a.j.r.Summariser: summary =      1 in 00:00:01 =    1.5/s Avg:   503 Min:   503 Max:   503 Err:     0 (0.00%)
2020-04-19 00:11:38,351 INFO o.a.j.JMeter: Generating Dashboard
2020-04-19 00:11:38,351 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2020-04-19 00:11:38,363 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2020-04-19 00:11:38,442 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2020-04-19 00:11:38,442 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2020-04-19 00:11:38,445 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2020-04-19 00:11:38,445 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2020-04-19 00:11:38,450 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2020-04-19 00:11:38,460 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2020-04-19 00:11:38,460 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2020-04-19 00:11:38,460 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2020-04-19 00:11:38,471 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2020-04-19 00:11:38,472 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2020-04-19 00:11:38,472 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2020-04-19 00:11:38,472 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2020-04-19 00:11:38,474 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2020-04-19 00:11:38,475 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 7 samples
2020-04-19 00:11:38,475 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2020-04-19 00:11:38,475 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2020-04-19 00:11:38,475 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2020-04-19 00:11:38,475 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2020-04-19 00:11:38,475 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2020-04-19 00:11:38,475 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2020-04-19 00:11:38,476 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2020-04-19 00:11:38,476 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2020-04-19 00:11:38,476 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2020-04-19 00:11:38,476 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2020-04-19 00:11:38,476 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 15 samples
2020-04-19 00:11:38,476 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 3 samples
2020-04-19 00:11:38,476 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 1 samples
2020-04-19 00:11:38,477 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 1 samples produced in 85ms on channel 0
2020-04-19 00:11:38,477 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2020-04-19 00:11:38,480 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary in context
2020-04-19 00:11:38,480 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2020-04-19 00:11:38,480 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2020-04-19 00:11:38,481 INFO o.a.j.r.d.JsonExporter: Checking output folder
2020-04-19 00:11:38,481 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to /Users/naresh/git-workspace/jmeter-performance-testing/list-users-results/statistics.json
2020-04-19 00:11:38,711 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2020-04-19 00:11:38,715 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: /Users/naresh/git-workspace/jmeter-performance-testing/list-users-results
2020-04-19 00:11:38,837 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: /Users/naresh/git-workspace/jmeter-performance-testing/list-users-results, creating folder structure
2020-04-19 00:11:38,842 INFO o.a.j.r.d.TemplateVisitor: Copying folder from '/usr/local/Cellar/jmeter/5.2.1/libexec/bin/report-template' to '/Users/naresh/git-workspace/jmeter-performance-testing/list-users-results', got message: /Users/naresh/git-workspace/jmeter-performance-testing/list-users-results, found non empty folder with following content [/Users/naresh/git-workspace/jmeter-performance-testing/list-users-results/statistics.json], will be ignored
2020-04-19 00:11:39,267 INFO o.a.j.JMeter: Dashboard generated